Update authentication.md
